// import "./App.css";
import React, { Component } from "react";
import axios from "axios";
import Header from "./components/Header/Header";
import Info from "./components/Info/Info";
import Teachers from "./components/Teachers/Teachers";

import SendDocs from "./components/SendDocs/SendDocs";
import StudyWays from "./components/StudyWays/StudyWays";
import GroupMusic from "./components/GroupMusic/GroupMusic";
import Navigation from "./components/Header/Navigation/Navigation";
import { getData } from "./components/api/api";
export default class App extends Component {
  state = {
    isLoading: false,
    error: null,

    info: {
      data_01:
        "Сьогодні музична школа – це сучасний мистецький навчальний заклад, до якого протягом 55 років кожного дня приходять діти для неповторної зустрічі зі світом музики і мистецтва. За ці роки у стінах школи здобули музичну освіту 1200 учнів, 230 з них про довжили своє навчання у спеціалізованих мистецьких закладах. Музика стала їхнім життям. Школа може пишатися випускниками, які зараз навчаються та працюють не тільки в нашій країні, а й у різних куточках світу:",
      data_02:
        "Історія Тростянецької дитячої музичної школи імені П.І. Чайковського розпочалася в далекому 1964 році. Саме тоді Матвієнко Ю.М. – викладач класу баяна та перший директор школи – разом з молодими викладачами облаштував приміщення в новозбудованій споруді, створив матеріальну базу школи та організував перший набір учнів. У 1972 році підхопив естафету і продовжив вже розпочату роботу Неонета О.І. – викладач класу баяна, який уважно ставився до ініціатив та потреб колективу. В 1974 році посаду директора школи отримав Маснуха І.І., викладач класу духових інструментів, організатор та незмінний керівник духового оркестру. Він очолював музичну школу 32 роки, зберігав та підтримував вже започатковані традиції школи, а також створював нові. Тримати планку досягнень школи керівникам допомагали їх заступники. В різні роки ними ставали: Неонета О.І., Кушніров В.Л., Рудик М.С., Тараненко О.А., Галушкіна С.О.. Всі досягнення та творчі злети історії школи пов’язані з іменами людей, сповнених творчого ентузіазму, колосальної працездатності, високої внутрішньої культури, які віддали своє серце улюбленій справі, учням та колективу. Значний вклад у творче життя школи внесли викладачі Гриценко Т.Г., Юшкевич А. М., Маснуха І.І., Матвієнко Ю.М., Рудик М.С., Шаповал В.І., Яценко Н.І., Кушніров В.Л., Нужненко М.І., Шаповал Т.В., Кушнірова В.П., Катриченко Є.В., Стеблянко Л.М., Зіненко Р.Б., Кошель О.В., Книшенко С.П., Жовтенко Л.І., Нога Т.Б., Ємець В.Б., Балабіна О.В.. З 2006 року колектив школи очолює Галушкіна С.О. - випускниця школи, викладач класу баяна, організатор Відкритого регіонального конкурсу юних музикантів «Зірковий дощ», керівник ансамблю викладачів. З того часу Світлана Олександрівна разом з педагогічним колективом високо тримає мистецький рівень закладу та сприяє розвитку матеріально-технічної бази школи. Разом з нею незмінно працює її заступник, досвідчений викладач класу фортепіано Колодяжна М.В., яка успішно налагоджує навчально-виховний процес закладу. Сьогоднішній викладацький склад зберігає кращий музично-педагогічний досвід та адаптує його до вимог сучасності. Нині в школі успішно працюють: Маснуха І.І., Карташова І.М., Колодяжна М.В., Призенко О.В., Книшенко Н.П., Галушкіна С.О., Карачевцева І.О., Рубан Т.М., Урсакій Т.М., Петренко І.В., Мельник Л.Б., , Рубан З.М., Самодай Т.М., Кварта О.Ю., Сосєдко Ю.В., Івашина Т.А., Самойлова Ю.О., Кравченко І.Б.",
      // img: infoInnerImg,
    },
    departments: {
      "Фортепіанний відділ": [
        {
          id: 1,
          // img: "../../img/teachers/1-1.png",
          // img: "/src/img/teachers/1-1.png",
          // img: piano1,
          info:
            "Завідувачка фортепіанного відділу, викладач класу фортепіано, концертмейстер",
          name: "Самойлова Юлія Олегівна",
        },
        {
          id: 2,
          // img: piano2,
          info:
            "Заступник директора з навчально-виховної роботи, викладач класу фортепіано, концертмейстер",
          name: "Колодяжна Марина Володимирівна",
        },
        {
          id: 3,
          // img: piano3,
          info: "Викладач класу фортепіано, концертмейстер",
          name: "Призенко Олена Вячеславівна",
        },
        {
          id: 4,
          // img: piano3,
          info: "Викладач класу фортепіано, сольного співу, концертмейстер",
          name: "Книшенко Наталія Петрівна",
        },
        {
          id: 5,
          // img: piano2,
          info: "Викладач теоретичних дисциплін",
          name: "Урсакій Тетяна Миколаївна",
        },
        {
          id: 6,
          // img: piano1,
          // img: "./Teachers/img/2-3.png",
          info: "Викладач класу фортепіано, концертмейстер",
          name: "Рубан Тетяна Миколаївна",
        },
        {
          id: 7,
          // img: "./Teachers/img/3-1.png",
          img:
            "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse4.mm.bing.net%2Fth%3Fid%3DOIP.YGTtgpHFV5RJvsBCIHiNKQHaEK%26pid%3DApi&f=1",
          info: "Викладач класу фортепіано, концертмейстер",
          name: "Самодай Тетяна Миколаївна",
        },
        {
          id: 8,
          img: "./Teachers/img/3-2.png",
          info: "Концертмейстер, викладач класу фортепіано",
          name: "Кварта Ольга Юріївна",
        },
        {
          id: 9,
          img: "./Teachers/img/3-3.png",
          info: "Викладач класу сольного співу",
          name: "Кравченко Ірина Борисівна",
        },
      ],
      "Оркестровий відділ": [
        {
          id: 12,
          // img: piano1,
          info: "Завідувачка оркестрового відділу, викладач класу скрипки",
          name: "Мельник Любов Борисівна",
        },
        {
          id: 13,
          // img: piano2,
          info: "Викладач класудухових інструментів",
          name: "Маснуха Іван Іванович",
        },
        {
          id: 14,
          // img: piano2,
          info: "Викладач класу скрипки",
          name: "Петренко Ірина Володимирівна",
        },
        {
          id: 15,
          // img: piano3,
          info: "Викладач класудухових та ударних інструментів",
          name: "Сосєдко Юрій Васильович",
        },
      ],
      "Відділ народних інструментів": [
        {
          id: 21,
          // img: piano1,
          info:
            "Завідувачка відділу народних інструментів, викладач класу домри, гітари",
          name: "Івашина Тетяна Анатоліївна",
        },
        {
          id: 22,
          // img: piano2,
          info: "Викладач класу домри, гітари",
          name: "Карташова Ірина Миколаївна",
        },
        {
          id: 23,
          // img: piano3,
          info: "Директор школи, викладач класу баяну, акордеону",
          name: "Галушкіна Світлана Олександрівна",
        },
        {
          id: 24,
          // img: piano3,
          info: "Викладач класу баяну, акордеону, гітари",
          name: "Карачевцева Ірина Олексіївна",
        },
        {
          id: 25,
          // img: piano1,
          info: "Викладач класу баяну, акордеону, гітари",
          name: "Рубан Зінаїда Миколаївна",
        },
      ],
      "НАПРЯМКИ НАВЧАННЯ": [
        {
          id: 31,
          // img: piano1,
          name: "Вокал",
        },
        {
          id: 32,
          // img: piano1,
          name: "Скрипка",
        },
        {
          id: 33,
          // img: piano2,
          name: "Фортепіано",
        },
        {
          id: 34,
          // img: piano3,
          name: "Акордеон, баян",
        },
        {
          id: 35,
          // img: piano2,
          name: "Гітара",
        },
        {
          id: 36,
          // img: piano1,
          name: "Мідні духові",
        },
        {
          id: 37,
          // img: piano3,
          name: "Дерев’яні духові",
        },
      ],
      "КОЛЕКТИВНЕ МУЗИКУВАННЯ": {
        innerLeftGroup1: [
          {
            id: 101,
            // img: group01_01,
            name: "Духовий оркестр",
            yaer: "Рік створення 1969р.",
            director: "Керівник І.І. Маснуха.",
            info: `
                       Досягнення: фестивал та конкурси: духових оркестрів в таборі “Молода гвардія” м.Одеса, “Сонячні кларнети” м.Київ, “Азовські вітрила” м.Бердянськ, “Золотий лелека” м.Миколаїв, “Сурми Конституції” м.Суми, “Боромля”, “Чарівна мідь оркестрів” м.Суми.`,
          },
          {
            id: 102,
            // img: group01_02,
            name: "Інструментальний ансамбль «КаданС»",
            yaer: "Рік створення 2010 р.",
            director: "Керівник - Ю.В. Сосєдко.",
            info:
              " Досягнення: фестивалі та конкурси: «Джаз-Вітраж», «Боромля».",
          },
          {
            id: 103,
            // img: group01_03,
            name: "Ансамбль гітаристів",
            yaer: "Рік створення 2017р.",
            director: "Керівник І.М. Карташова.",
            info:
              "Досягнення: фестивалі та конкурси: «Весняний заспів Тростянеччини», «Чайковський-FEST, «Камерата»; «Джаз-Вітраж»; “Боромля”, «Барви Полтави», “La Cvart”, «Арт Домінанта»",
          },
          {
            id: 104,
            // img: group01_04,
            name: "Хор молодших класів",
            yaer: "",
            director: "",
            info: "Керівник  Н.П. Книшенко.",
          },
          {
            id: 105,
            // img: group01_05,
            name: "Дует домристів",
            yaer: "",
            director: "",
            info: "Керівник  І.М. Карташова.",
          },
        ],
        innerRight: [
          {
            id: 201,
            // img: group01_01,
            name: "Ансамбль скрипалів «Елегія»",
            yaer: "Рік створення 1975 р",
            director: "Керівник  М.С. Рудик (з 1975 до 1997рр.).",
            info:
              "Досягнення: фестивалі та конкурси: «Весняний заспів Тростянеччини», «Чайковський-FEST», “Чарівний смичок”,  “Зірковий дощ”, «Джаз-Вітраж», “Боромля”, «Слобожанська осінь».",
          },
          {
            id: 202,
            // img: group01_03,
            name: "Ансамбль викладачів",
            yaer: "Рік створення 2010 р",
            director: "Керівник С.О. Галушкіна",
            // info: group01_01,
          },
          {
            id: 203,
            // img: group01_02,
            name: "Ансамбль домристів",
            yaer: "Рік створення 2018 р",
            director: "Керівник Т.А. Івашина.",
            info: "Досягнення: фестивалі та конкурси: «Барви Полтави».",
          },
          {
            id: 204,
            img: "",
            name: "Ансамбль народних інструментів",
            yaer: "",
            director: "Керівник З.М. Рубан.",
            info: "",
          },
          {
            id: 205,
            img: "",
            name: "Дует гітаристів",
            yaer: "",
            director: "Керівник Т.А. Івашина.",
            info: "",
          },
        ],
        innerLeftGroup2: [
          {
            id: 301,
            // img: group01_02,
            name: "Дитячий вокальний ансамбль «Зернятко»",
            yaer: "Рік створення 2007 р",
            director: "Керівник О. В. Призенко.",
            info:
              "Досягнення:  фестивалі та конкурси: «Боромля», «Котилася торба», «Від Різдва до Водохреща».",
          },
          {
            id: 302,
            // img: group01_03,
            name: "Камерний ансамбль «Квінтолька»",
            yaer: "Рік створення 2015 р",
            director:
              "Керівники:  І.В. Петренко, Т.А. Івашина та М.В. Колодяжна",
            info:
              "Досягнення: фестивалі та конкурси: «Джаз-Вітраж», «Пролісок»",
          },
          {
            id: 303,
            // img: group01_04,
            name: "Вокальний ансамбль «Зорепад»",
            yaer: "Рік створення 2017 р",
            director: "Керівник Т.А. Івашина.",
            // info: group01_01,
          },
          {
            id: 304,
            img: "",
            name: "Фортепіанний ансамбль",
            yaer: "",
            director: "",
            info: "",
          },
        ],
      },
      "ПОДАЧА ДОКУМЕНТІВ": [
        {
          id: 401,
          // img: piano1,
          name: "Вік",
          info: "6-16 років",
        },
        {
          id: 402,
          // img: piano2,
          name: "Шаблони заявок",
          doc: "Документ1.docx",
          doc1: "Документ2.docx",
          doc2: "Документ3.docx",
        },
        {
          id: 403,
          // img: piano3,
          name: "Літо та зима",
          info: "20.08 - 31.08",
          info1: "20.02 - 28.02",
        },
      ],
    },

    // footer: footer,
    author:
      "Made with love by <a>zart</a> — fork or suggest edits on <a>GitHub</a>",
  };
  async componentDidMount() {
    this.setState({ isLoading: true });

    // axios
    //   .get("http://musicschool/api/")
    //   .then((response) =>
    //     this.setState({ fetchData: [...response.data] })
    //   )

    // this.setState({ fetchData: await getData(), isLoading: false });

    getData()
      .then((data) => {
        this.setState({
          fetchData: data,
        });
      })
      .catch((error) => this.setState({ error }))
      .finally(() => this.setState({ isLoading: false }));

    // {
    //   this.state.fetchData &&
    //     this.state.fetchData.map((item) => {
    //       console.log('item.depart === "piano"', item.depart === "piano");
    //       this.setState({ piano: item.depart === "piano" });

    //       // return item.depart === "piano";
    //     });
    // }
  }

  logger() {
    {
      this.state.fetchData &&
        this.state.fetchData.filter((item) => {
          // console.log('item.depart === "piano"', item.depart === "piano");
          // this.setState({ piano: item.depart === "piano" });
          // return item.depart === "piano";
        });
    }

    console.log("this.state", this.state);

    //  const piano =  this.state.fetchData.map(
    //     (item) => {
    //       console.log('item.depart === "piano"', item.depart === "piano");
    //       // item.depart === "piano"
    //     }

    //     //         this.setState({piano = {
    //     // item.piano}
    //     //       })
    //   );
  }

  render() {
    console.log("sssss", this.state.isLoading);
    console.log("render");
    this.logger();
    {
      this.state.fetchData &&
        console.log("this.state.fetchData", this.state.fetchData);
    }
    return (
      <>
        {/* {this.state.error && <p>Что-то пошло не так: {error.message}</p>} */}
        {this.state.isLoading && <p>Loading...</p>}
        <Header />

        <div className="container">
        
          {/* {this.state.fetchData[0].depart} */}
          <Info data={this.state.info} />
          <Teachers data={this.state.departments} />
          <StudyWays
            data={this.state.departments["НАПРЯМКИ НАВЧАННЯ"]}
            title={"НАПРЯМКИ НАВЧАННЯ"}
          />
          <GroupMusic
            data={this.state.departments["КОЛЕКТИВНЕ МУЗИКУВАННЯ"]}
            title={"КОЛЕКТИВНЕ МУЗИКУВАННЯ"}
          />
          <SendDocs
            data={this.state.departments["ПОДАЧА ДОКУМЕНТІВ"]}
            title={"ПОДАЧА ДОКУМЕНТІВ"}
          />
          {/* <Footer data={this.state.footer} author={this.state.author} /> */}
        </div>
      </>
    );
  }
}

// <div className="App">
{
  /* <header className="App-header">
        <img src={logo} className="App-logo" alt="logo" />
        <p>
          Edit <code>src/App.js</code> and save to reload.
        </p>
        <a
          className="App-link"
          href="https://reactjs.org"
          target="_blank"
          rel="noopener noreferrer"
        >
          Learn React
        </a>
      </header>
     */
}

// </div>

// state = {
//   isLoading: true,
//   error: null,
//   info: {
//     data_01:
//       "Сьогодні музична школа – це сучасний мистецький навчальний заклад, до якого протягом 55 років кожного дня приходять діти для неповторної зустрічі зі світом музики і мистецтва. За ці роки у стінах школи здобули музичну освіту 1200 учнів, 230 з них про довжили своє навчання у спеціалізованих мистецьких закладах. Музика стала їхнім життям. Школа може пишатися випускниками, які зараз навчаються та працюють не тільки в нашій країні, а й у різних куточках світу:",
//     data_02:
//       "Історія Тростянецької дитячої музичної школи імені П.І. Чайковського розпочалася в далекому 1964 році. Саме тоді Матвієнко Ю.М. – викладач класу баяна та перший директор школи – разом з молодими викладачами облаштував приміщення в новозбудованій споруді, створив матеріальну базу школи та організував перший набір учнів. У 1972 році підхопив естафету і продовжив вже розпочату роботу Неонета О.І. – викладач класу баяна, який уважно ставився до ініціатив та потреб колективу. В 1974 році посаду директора школи отримав Маснуха І.І., викладач класу духових інструментів, організатор та незмінний керівник духового оркестру. Він очолював музичну школу 32 роки, зберігав та підтримував вже започатковані традиції школи, а також створював нові. Тримати планку досягнень школи керівникам допомагали їх заступники. В різні роки ними ставали: Неонета О.І., Кушніров В.Л., Рудик М.С., Тараненко О.А., Галушкіна С.О.. Всі досягнення та творчі злети історії школи пов’язані з іменами людей, сповнених творчого ентузіазму, колосальної працездатності, високої внутрішньої культури, які віддали своє серце улюбленій справі, учням та колективу. Значний вклад у творче життя школи внесли викладачі Гриценко Т.Г., Юшкевич А. М., Маснуха І.І., Матвієнко Ю.М., Рудик М.С., Шаповал В.І., Яценко Н.І., Кушніров В.Л., Нужненко М.І., Шаповал Т.В., Кушнірова В.П., Катриченко Є.В., Стеблянко Л.М., Зіненко Р.Б., Кошель О.В., Книшенко С.П., Жовтенко Л.І., Нога Т.Б., Ємець В.Б., Балабіна О.В.. З 2006 року колектив школи очолює Галушкіна С.О. - випускниця школи, викладач класу баяна, організатор Відкритого регіонального конкурсу юних музикантів «Зірковий дощ», керівник ансамблю викладачів. З того часу Світлана Олександрівна разом з педагогічним колективом високо тримає мистецький рівень закладу та сприяє розвитку матеріально-технічної бази школи. Разом з нею незмінно працює її заступник, досвідчений викладач класу фортепіано Колодяжна М.В., яка успішно налагоджує навчально-виховний процес закладу. Сьогоднішній викладацький склад зберігає кращий музично-педагогічний досвід та адаптує його до вимог сучасності. Нині в школі успішно працюють: Маснуха І.І., Карташова І.М., Колодяжна М.В., Призенко О.В., Книшенко Н.П., Галушкіна С.О., Карачевцева І.О., Рубан Т.М., Урсакій Т.М., Петренко І.В., Мельник Л.Б., , Рубан З.М., Самодай Т.М., Кварта О.Ю., Сосєдко Ю.В., Івашина Т.А., Самойлова Ю.О., Кравченко І.Б.",
//     // img: infoInnerImg,
//   },
//   departments: {
//     "Фортепіанний відділ": [
//       {
//         id: 1,
//         // img: "../../img/teachers/1-1.png",
//         // img: "/src/img/teachers/1-1.png",
//         // img: piano1,
//         info:
//           "Завідувачка фортепіанного відділу, викладач класу фортепіано, концертмейстер",
//         name: "Самойлова Юлія Олегівна",
//       },
//       {
//         id: 2,
//         // img: piano2,
//         info:
//           "Заступник директора з навчально-виховної роботи, викладач класу фортепіано, концертмейстер",
//         name: "Колодяжна Марина Володимирівна",
//       },
//       {
//         id: 3,
//         // img: piano3,
//         info: "Викладач класу фортепіано, концертмейстер",
//         name: "Призенко Олена Вячеславівна",
//       },
//       {
//         id: 4,
//         // img: piano3,
//         info: "Викладач класу фортепіано, сольного співу, концертмейстер",
//         name: "Книшенко Наталія Петрівна",
//       },
//       {
//         id: 5,
//         // img: piano2,
//         info: "Викладач теоретичних дисциплін",
//         name: "Урсакій Тетяна Миколаївна",
//       },
//       {
//         id: 6,
//         // img: piano1,
//         // img: "./Teachers/img/2-3.png",
//         info: "Викладач класу фортепіано, концертмейстер",
//         name: "Рубан Тетяна Миколаївна",
//       },
//       {
//         id: 7,
//         // img: "./Teachers/img/3-1.png",
//         img:
//           "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse4.mm.bing.net%2Fth%3Fid%3DOIP.YGTtgpHFV5RJvsBCIHiNKQHaEK%26pid%3DApi&f=1",
//         info: "Викладач класу фортепіано, концертмейстер",
//         name: "Самодай Тетяна Миколаївна",
//       },
//       {
//         id: 8,
//         img: "./Teachers/img/3-2.png",
//         info: "Концертмейстер, викладач класу фортепіано",
//         name: "Кварта Ольга Юріївна",
//       },
//       {
//         id: 9,
//         img: "./Teachers/img/3-3.png",
//         info: "Викладач класу сольного співу",
//         name: "Кравченко Ірина Борисівна",
//       },
//     ],
//     "Оркестровий відділ": [
//       {
//         id: 12,
//         // img: piano1,
//         info: "Завідувачка оркестрового відділу, викладач класу скрипки",
//         name: "Мельник Любов Борисівна",
//       },
//       {
//         id: 13,
//         // img: piano2,
//         info: "Викладач класудухових інструментів",
//         name: "Маснуха Іван Іванович",
//       },
//       {
//         id: 14,
//         // img: piano2,
//         info: "Викладач класу скрипки",
//         name: "Петренко Ірина Володимирівна",
//       },
//       {
//         id: 15,
//         // img: piano3,
//         info: "Викладач класудухових та ударних інструментів",
//         name: "Сосєдко Юрій Васильович",
//       },
//     ],
//     "Відділ народних інструментів": [
//       {
//         id: 21,
//         // img: piano1,
//         info:
//           "Завідувачка відділу народних інструментів, викладач класу домри, гітари",
//         name: "Івашина Тетяна Анатоліївна",
//       },
//       {
//         id: 22,
//         // img: piano2,
//         info: "Викладач класу домри, гітари",
//         name: "Карташова Ірина Миколаївна",
//       },
//       {
//         id: 23,
//         // img: piano3,
//         info: "Директор школи, викладач класу баяну, акордеону",
//         name: "Галушкіна Світлана Олександрівна",
//       },
//       {
//         id: 24,
//         // img: piano3,
//         info: "Викладач класу баяну, акордеону, гітари",
//         name: "Карачевцева Ірина Олексіївна",
//       },
//       {
//         id: 25,
//         // img: piano1,
//         info: "Викладач класу баяну, акордеону, гітари",
//         name: "Рубан Зінаїда Миколаївна",
//       },
//     ],
//     "НАПРЯМКИ НАВЧАННЯ": [
//       {
//         id: 31,
//         // img: piano1,
//         name: "Вокал",
//       },
//       {
//         id: 32,
//         // img: piano1,
//         name: "Скрипка",
//       },
//       {
//         id: 33,
//         // img: piano2,
//         name: "Фортепіано",
//       },
//       {
//         id: 34,
//         // img: piano3,
//         name: "Акордеон, баян",
//       },
//       {
//         id: 35,
//         // img: piano2,
//         name: "Гітара",
//       },
//       {
//         id: 36,
//         // img: piano1,
//         name: "Мідні духові",
//       },
//       {
//         id: 37,
//         // img: piano3,
//         name: "Дерев’яні духові",
//       },
//     ],
//     "КОЛЕКТИВНЕ МУЗИКУВАННЯ": {
//       innerLeftGroup1: [
//         {
//           id: 101,
//           // img: group01_01,
//           name: "Духовий оркестр",
//           yaer: "Рік створення 1969р.",
//           director: "Керівник І.І. Маснуха.",
//           info: `
//                  Досягнення: фестивал та конкурси: духових оркестрів в таборі “Молода гвардія” м.Одеса, “Сонячні кларнети” м.Київ, “Азовські вітрила” м.Бердянськ, “Золотий лелека” м.Миколаїв, “Сурми Конституції” м.Суми, “Боромля”, “Чарівна мідь оркестрів” м.Суми.`,
//         },
//         {
//           id: 102,
//           // img: group01_02,
//           name: "Інструментальний ансамбль «КаданС»",
//           yaer: "Рік створення 2010 р.",
//           director: "Керівник - Ю.В. Сосєдко.",
//           info:
//             " Досягнення: фестивалі та конкурси: «Джаз-Вітраж», «Боромля».",
//         },
//         {
//           id: 103,
//           // img: group01_03,
//           name: "Ансамбль гітаристів",
//           yaer: "Рік створення 2017р.",
//           director: "Керівник І.М. Карташова.",
//           info:
//             "Досягнення: фестивалі та конкурси: «Весняний заспів Тростянеччини», «Чайковський-FEST, «Камерата»; «Джаз-Вітраж»; “Боромля”, «Барви Полтави», “La Cvart”, «Арт Домінанта»",
//         },
//         {
//           id: 104,
//           // img: group01_04,
//           name: "Хор молодших класів",
//           yaer: "",
//           director: "",
//           info: "Керівник  Н.П. Книшенко.",
//         },
//         {
//           id: 105,
//           // img: group01_05,
//           name: "Дует домристів",
//           yaer: "",
//           director: "",
//           info: "Керівник  І.М. Карташова.",
//         },
//       ],
//       innerRight: [
//         {
//           id: 201,
//           // img: group01_01,
//           name: "Ансамбль скрипалів «Елегія»",
//           yaer: "Рік створення 1975 р",
//           director: "Керівник  М.С. Рудик (з 1975 до 1997рр.).",
//           info:
//             "Досягнення: фестивалі та конкурси: «Весняний заспів Тростянеччини», «Чайковський-FEST», “Чарівний смичок”,  “Зірковий дощ”, «Джаз-Вітраж», “Боромля”, «Слобожанська осінь».",
//         },
//         {
//           id: 202,
//           // img: group01_03,
//           name: "Ансамбль викладачів",
//           yaer: "Рік створення 2010 р",
//           director: "Керівник С.О. Галушкіна",
//           // info: group01_01,
//         },
//         {
//           id: 203,
//           // img: group01_02,
//           name: "Ансамбль домристів",
//           yaer: "Рік створення 2018 р",
//           director: "Керівник Т.А. Івашина.",
//           info: "Досягнення: фестивалі та конкурси: «Барви Полтави».",
//         },
//         {
//           id: 204,
//           img: "",
//           name: "Ансамбль народних інструментів",
//           yaer: "",
//           director: "Керівник З.М. Рубан.",
//           info: "",
//         },
//         {
//           id: 205,
//           img: "",
//           name: "Дует гітаристів",
//           yaer: "",
//           director: "Керівник Т.А. Івашина.",
//           info: "",
//         },
//       ],
//       innerLeftGroup2: [
//         {
//           id: 301,
//           // img: group01_02,
//           name: "Дитячий вокальний ансамбль «Зернятко»",
//           yaer: "Рік створення 2007 р",
//           director: "Керівник О. В. Призенко.",
//           info:
//             "Досягнення:  фестивалі та конкурси: «Боромля», «Котилася торба», «Від Різдва до Водохреща».",
//         },
//         {
//           id: 302,
//           // img: group01_03,
//           name: "Камерний ансамбль «Квінтолька»",
//           yaer: "Рік створення 2015 р",
//           director:
//             "Керівники:  І.В. Петренко, Т.А. Івашина та М.В. Колодяжна",
//           info:
//             "Досягнення: фестивалі та конкурси: «Джаз-Вітраж», «Пролісок»",
//         },
//         {
//           id: 303,
//           // img: group01_04,
//           name: "Вокальний ансамбль «Зорепад»",
//           yaer: "Рік створення 2017 р",
//           director: "Керівник Т.А. Івашина.",
//           // info: group01_01,
//         },
//         {
//           id: 304,
//           img: "",
//           name: "Фортепіанний ансамбль",
//           yaer: "",
//           director: "",
//           info: "",
//         },
//       ],
//     },
//     "ПОДАЧА ДОКУМЕНТІВ": [
//       {
//         id: 401,
//         // img: piano1,
//         name: "Вік",
//         info: "6-16 років",
//       },
//       {
//         id: 402,
//         // img: piano2,
//         name: "Шаблони заявок",
//         doc: "Документ1.docx",
//         doc1: "Документ2.docx",
//         doc2: "Документ3.docx",
//       },
//       {
//         id: 403,
//         // img: piano3,
//         name: "Літо та зима",
//         info: "20.08 - 31.08",
//         info1: "20.02 - 28.02",
//       },
//     ],
//   },

//   // footer: footer,
//   author:
//     "Made with love by <a>zart</a> — fork or suggest edits on <a>GitHub</a>",
// };
